EDT.СЭ_Доработки/src/Documents/КадровыйПеревод/КадровыйПеревод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9f3711e5-69f1-406d-b6f7-9e1d9ebc4707">
  <name>КадровыйПеревод</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="31cabfea-261c-4cfa-a268-e0780f17f0b4">
    <name>СрочныйДоговор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8dcb780f-435e-47bd-a85c-87e140b04614">
    <name>СЭ_ТипДополнительногоСоглашения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a82a1d77-9c7a-408d-b2d5-717ff99a5685">
    <name>СЭ_ДатаДопСоглашения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf8ca40d-d8ba-4aa6-8843-42984ef1fa3e">
    <name>СЭ_НомерДопСоглашения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2e23147f-5fa0-466e-b3d9-14b554c1d2db">
    <name>СЭ_ДобавитьИзменитьДопСоглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

EDT.СЭ_Доработки/src/Documents/КадровыйПеревод/ObjectModule.bsl
&После("ПриКопировании")
Процедура СЭ_ПриКопировании(ОбъектКопирования)
	//+СЭ Пилипчук 0016039
	СЭ_Серия = Неопределено;
	СЭ_НомерПоСерии = Неопределено; 
	//-СЭ Пилипчук 0016039
КонецПроцедуры


&После("ОбработкаПроверкиЗаполнения")
Процедура СЭ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//СЭ Ульяна 0016035
	
	Если ЗначениеЗаполнено(СЭ_ТипДополнительногоСоглашения)
		И НЕ ЗначениеЗаполнено(СЭ_НомерДопСоглашения)  Тогда 
		Отказ = Истина;
		ТекстСообщения = "Номер доп.соглашения пустой! Запись документа невозможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.СЭ_НомерДопСоглашения", , Отказ)
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СЭ_ТипДополнительногоСоглашения)
		И НЕ ЗначениеЗаполнено(СЭ_ДатаДопСоглашения)  Тогда 
		Отказ = Истина;
		ТекстСообщения = "Дата доп.соглашения пустая! Запись документа невозможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.СЭ_ДатаДопСоглашения", , Отказ)
	КонецЕсли;
	//СЭ Ульяна 0016035

КонецПроцедуры
